HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_bf.h
/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN25 */
#define IFX_EBU_ACCEN0_EN25_OFF (25)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN26 */
#define IFX_EBU_ACCEN0_EN26_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN26 */
#define IFX_EBU_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN26 */
#define IFX_EBU_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN27 */
#define IFX_EBU_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN27 */
#define IFX_EBU_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN27 */
#define IFX_EBU_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN28 */
#define IFX_EBU_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN28 */
#define IFX_EBU_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN28 */
#define IFX_EBU_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN29 */
#define IFX_EBU_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN29 */
#define IFX_EBU_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN29 */
#define IFX_EBU_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN2 */
#define IFX_EBU_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN2 */
#define IFX_EBU_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN2 */
#define IFX_EBU_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN30 */
#define IFX_EBU_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN30 */
#define IFX_EBU_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN30 */
#define IFX_EBU_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN31 */
#define IFX_EBU_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN31 */
#define IFX_EBU_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN31 */
#define IFX_EBU_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN3 */
#define IFX_EBU_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN3 */
#define IFX_EBU_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN3 */
#define IFX_EBU_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN4 */
#define IFX_EBU_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN4 */
#define IFX_EBU_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN4 */
#define IFX_EBU_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN5 */
#define IFX_EBU_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN5 */
#define IFX_EBU_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN5 */
#define IFX_EBU_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN6 */
#define IFX_EBU_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN6 */
#define IFX_EBU_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN6 */
#define IFX_EBU_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN7 */
#define IFX_EBU_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN7 */
#define IFX_EBU_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN7 */
#define IFX_EBU_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN8 */
#define IFX_EBU_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN8 */
#define IFX_EBU_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN8 */
#define IFX_EBU_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_EBU_ACCEN0_Bits.EN9 */
#define IFX_EBU_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_EBU_ACCEN0_Bits.EN9 */
#define IFX_EBU_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ACCEN0_Bits.EN9 */
#define IFX_EBU_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_LEN (1)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_OFF (1)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_LEN (4)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_OFF (8)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_LEN (20)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_MSK (0xfffff)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_OFF (12)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_LEN (1)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_OFF (3)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_LEN (4)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_OFF (4)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_LEN (1)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_OFF (0)

/** \\brief  Length for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_LEN (1)

/** \\brief  Mask for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_OFF (2)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.ADDRC */
#define IFX_EBU_BUSRAP_ADDRC_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.ADDRC */
#define IFX_EBU_BUSRAP_ADDRC_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.ADDRC */
#define IFX_EBU_BUSRAP_ADDRC_OFF (28)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.AHOLDC */
#define IFX_EBU_BUSRAP_AHOLDC_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.AHOLDC */
#define IFX_EBU_BUSRAP_AHOLDC_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.AHOLDC */
#define IFX_EBU_BUSRAP_AHOLDC_OFF (24)

