HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_bf.h
/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.CMDDELAY */
#define IFX_EBU_BUSRAP_CMDDELAY_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.CMDDELAY */
#define IFX_EBU_BUSRAP_CMDDELAY_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.CMDDELAY */
#define IFX_EBU_BUSRAP_CMDDELAY_OFF (20)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.DATAC */
#define IFX_EBU_BUSRAP_DATAC_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.DATAC */
#define IFX_EBU_BUSRAP_DATAC_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.DATAC */
#define IFX_EBU_BUSRAP_DATAC_OFF (12)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.EXTCLOCK */
#define IFX_EBU_BUSRAP_EXTCLOCK_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.EXTCLOCK */
#define IFX_EBU_BUSRAP_EXTCLOCK_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.EXTCLOCK */
#define IFX_EBU_BUSRAP_EXTCLOCK_OFF (16)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.EXTDATA */
#define IFX_EBU_BUSRAP_EXTDATA_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.EXTDATA */
#define IFX_EBU_BUSRAP_EXTDATA_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.EXTDATA */
#define IFX_EBU_BUSRAP_EXTDATA_OFF (18)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.RDDTACS */
#define IFX_EBU_BUSRAP_RDDTACS_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.RDDTACS */
#define IFX_EBU_BUSRAP_RDDTACS_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.RDDTACS */
#define IFX_EBU_BUSRAP_RDDTACS_OFF (0)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.RDRECOVC */
#define IFX_EBU_BUSRAP_RDRECOVC_LEN (3)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.RDRECOVC */
#define IFX_EBU_BUSRAP_RDRECOVC_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.RDRECOVC */
#define IFX_EBU_BUSRAP_RDRECOVC_OFF (4)

/** \\brief  Length for Ifx_EBU_BUSRAP_Bits.WAITRDC */
#define IFX_EBU_BUSRAP_WAITRDC_LEN (5)

/** \\brief  Mask for Ifx_EBU_BUSRAP_Bits.WAITRDC */
#define IFX_EBU_BUSRAP_WAITRDC_MSK (0x1f)

/** \\brief  Offset for Ifx_EBU_BUSRAP_Bits.WAITRDC */
#define IFX_EBU_BUSRAP_WAITRDC_OFF (7)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.AAP */
#define IFX_EBU_BUSRCON_AAP_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.AAP */
#define IFX_EBU_BUSRCON_AAP_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.AAP */
#define IFX_EBU_BUSRCON_AAP_OFF (26)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.AGEN */
#define IFX_EBU_BUSRCON_AGEN_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.AGEN */
#define IFX_EBU_BUSRCON_AGEN_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.AGEN */
#define IFX_EBU_BUSRCON_AGEN_OFF (28)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.BCGEN */
#define IFX_EBU_BUSRCON_BCGEN_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.BCGEN */
#define IFX_EBU_BUSRCON_BCGEN_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.BCGEN */
#define IFX_EBU_BUSRCON_BCGEN_OFF (20)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.BFCMSEL */
#define IFX_EBU_BUSRCON_BFCMSEL_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.BFCMSEL */
#define IFX_EBU_BUSRCON_BFCMSEL_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.BFCMSEL */
#define IFX_EBU_BUSRCON_BFCMSEL_OFF (6)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.DBA */
#define IFX_EBU_BUSRCON_DBA_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.DBA */
#define IFX_EBU_BUSRCON_DBA_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.DBA */
#define IFX_EBU_BUSRCON_DBA_OFF (18)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.EBSE */
#define IFX_EBU_BUSRCON_EBSE_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.EBSE */
#define IFX_EBU_BUSRCON_EBSE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.EBSE */
#define IFX_EBU_BUSRCON_EBSE_OFF (17)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.ECSE */
#define IFX_EBU_BUSRCON_ECSE_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.ECSE */
#define IFX_EBU_BUSRCON_ECSE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.ECSE */
#define IFX_EBU_BUSRCON_ECSE_OFF (16)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.FBBMSEL */
#define IFX_EBU_BUSRCON_FBBMSEL_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.FBBMSEL */
#define IFX_EBU_BUSRCON_FBBMSEL_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.FBBMSEL */
#define IFX_EBU_BUSRCON_FBBMSEL_OFF (3)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.FDBKEN */
#define IFX_EBU_BUSRCON_FDBKEN_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.FDBKEN */
#define IFX_EBU_BUSRCON_FDBKEN_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.FDBKEN */
#define IFX_EBU_BUSRCON_FDBKEN_OFF (5)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.FETBLEN */
#define IFX_EBU_BUSRCON_FETBLEN_LEN (3)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.FETBLEN */
#define IFX_EBU_BUSRCON_FETBLEN_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.FETBLEN */
#define IFX_EBU_BUSRCON_FETBLEN_OFF (0)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.LCKABRT */
#define IFX_EBU_BUSRCON_LCKABRT_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.LCKABRT */
#define IFX_EBU_BUSRCON_LCKABRT_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.LCKABRT */
#define IFX_EBU_BUSRCON_LCKABRT_OFF (27)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.NAA */
#define IFX_EBU_BUSRCON_NAA_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.NAA */
#define IFX_EBU_BUSRCON_NAA_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.NAA */
#define IFX_EBU_BUSRCON_NAA_OFF (7)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.PORTW */
#define IFX_EBU_BUSRCON_PORTW_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.PORTW */
#define IFX_EBU_BUSRCON_PORTW_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.PORTW */
#define IFX_EBU_BUSRCON_PORTW_OFF (22)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.RES1 */
#define IFX_EBU_BUSRCON_RES1_LEN (8)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.RES1 */
#define IFX_EBU_BUSRCON_RES1_MSK (0xff)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.RES1 */
#define IFX_EBU_BUSRCON_RES1_OFF (8)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.RESERVED */
#define IFX_EBU_BUSRCON_RESERVED_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.RESERVED */
#define IFX_EBU_BUSRCON_RESERVED_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.RESERVED */
#define IFX_EBU_BUSRCON_RESERVED_OFF (4)

