HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_bf.h
/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.RES */
#define IFX_EBU_BUSWCON_RES_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.RES */
#define IFX_EBU_BUSWCON_RES_OFF (4)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.WAIT */
#define IFX_EBU_BUSWCON_WAIT_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.WAIT */
#define IFX_EBU_BUSWCON_WAIT_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.WAIT */
#define IFX_EBU_BUSWCON_WAIT_OFF (24)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.WAITINV */
#define IFX_EBU_BUSWCON_WAITINV_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.WAITINV */
#define IFX_EBU_BUSWCON_WAITINV_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.WAITINV */
#define IFX_EBU_BUSWCON_WAITINV_OFF (19)

/** \\brief  Length for Ifx_EBU_CLC_Bits.DISR */
#define IFX_EBU_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.DISR */
#define IFX_EBU_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.DISR */
#define IFX_EBU_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_EBU_CLC_Bits.DISS */
#define IFX_EBU_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.DISS */
#define IFX_EBU_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.DISS */
#define IFX_EBU_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_EBU_CLC_Bits.DIV2 */
#define IFX_EBU_CLC_DIV2_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.DIV2 */
#define IFX_EBU_CLC_DIV2_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.DIV2 */
#define IFX_EBU_CLC_DIV2_OFF (17)

/** \\brief  Length for Ifx_EBU_CLC_Bits.DIV2ACK */
#define IFX_EBU_CLC_DIV2ACK_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.DIV2ACK */
#define IFX_EBU_CLC_DIV2ACK_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.DIV2ACK */
#define IFX_EBU_CLC_DIV2ACK_OFF (21)

/** \\brief  Length for Ifx_EBU_CLC_Bits.EBUDIV */
#define IFX_EBU_CLC_EBUDIV_LEN (2)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.EBUDIV */
#define IFX_EBU_CLC_EBUDIV_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.EBUDIV */
#define IFX_EBU_CLC_EBUDIV_OFF (18)

/** \\brief  Length for Ifx_EBU_CLC_Bits.EBUDIVACK */
#define IFX_EBU_CLC_EBUDIVACK_LEN (2)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.EBUDIVACK */
#define IFX_EBU_CLC_EBUDIVACK_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.EBUDIVACK */
#define IFX_EBU_CLC_EBUDIVACK_OFF (22)

/** \\brief  Length for Ifx_EBU_CLC_Bits.EPE */
#define IFX_EBU_CLC_EPE_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.EPE */
#define IFX_EBU_CLC_EPE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.EPE */
#define IFX_EBU_CLC_EPE_OFF (8)

/** \\brief  Length for Ifx_EBU_CLC_Bits.SYNC */
#define IFX_EBU_CLC_SYNC_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.SYNC */
#define IFX_EBU_CLC_SYNC_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.SYNC */
#define IFX_EBU_CLC_SYNC_OFF (16)

/** \\brief  Length for Ifx_EBU_CLC_Bits.SYNCACK */
#define IFX_EBU_CLC_SYNCACK_LEN (1)

/** \\brief  Mask for Ifx_EBU_CLC_Bits.SYNCACK */
#define IFX_EBU_CLC_SYNCACK_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_CLC_Bits.SYNCACK */
#define IFX_EBU_CLC_SYNCACK_OFF (20)

/** \\brief  Length for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_LEN (1)

/** \\brief  Mask for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_OFF (0)

/** \\brief  Length for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_LEN (1)

/** \\brief  Mask for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_OFF (1)

/** \\brief  Length for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_LEN (1)

/** \\brief  Mask for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_OFF (31)

/** \\brief  Length for Ifx_EBU_ID_Bits.ID_VALUE */
#define IFX_EBU_ID_ID_VALUE_LEN (32)

/** \\brief  Mask for Ifx_EBU_ID_Bits.ID_VALUE */
#define IFX_EBU_ID_ID_VALUE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBU_ID_Bits.ID_VALUE */
#define IFX_EBU_ID_ID_VALUE_OFF (0)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_OFF (31)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.ARBMODE */
#define IFX_EBU_MODCON_ARBMODE_LEN (2)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.ARBMODE */
#define IFX_EBU_MODCON_ARBMODE_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.ARBMODE */
#define IFX_EBU_MODCON_ARBMODE_OFF (6)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.ARBSYNC */
#define IFX_EBU_MODCON_ARBSYNC_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.ARBSYNC */
#define IFX_EBU_MODCON_ARBSYNC_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.ARBSYNC */
#define IFX_EBU_MODCON_ARBSYNC_OFF (5)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_OFF (30)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.CLK_COMB */
#define IFX_EBU_MODCON_CLK_COMB_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.CLK_COMB */
#define IFX_EBU_MODCON_CLK_COMB_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.CLK_COMB */
#define IFX_EBU_MODCON_CLK_COMB_OFF (3)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.EXTLOCK */
#define IFX_EBU_MODCON_EXTLOCK_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.EXTLOCK */
#define IFX_EBU_MODCON_EXTLOCK_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.EXTLOCK */
#define IFX_EBU_MODCON_EXTLOCK_OFF (4)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_OFF (25)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.FIFO_BYPASS */
#define IFX_EBU_MODCON_FIFO_BYPASS_LEN (1)

