HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_bf.h
/** \\brief  Mask for Ifx_EBU_MODCON_Bits.FIFO_BYPASS */
#define IFX_EBU_MODCON_FIFO_BYPASS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.FIFO_BYPASS */
#define IFX_EBU_MODCON_FIFO_BYPASS_OFF (24)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.LCKABRT */
#define IFX_EBU_MODCON_LCKABRT_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.LCKABRT */
#define IFX_EBU_MODCON_LCKABRT_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.LCKABRT */
#define IFX_EBU_MODCON_LCKABRT_OFF (1)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_LEN (8)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_MSK (0xff)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_OFF (16)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_OFF (26)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.SDTRI */
#define IFX_EBU_MODCON_SDTRI_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.SDTRI */
#define IFX_EBU_MODCON_SDTRI_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.SDTRI */
#define IFX_EBU_MODCON_SDTRI_OFF (2)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.STS */
#define IFX_EBU_MODCON_STS_LEN (1)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.STS */
#define IFX_EBU_MODCON_STS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.STS */
#define IFX_EBU_MODCON_STS_OFF (0)

/** \\brief  Length for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_LEN (8)

/** \\brief  Mask for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_MSK (0xff)

/** \\brief  Offset for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_OFF (8)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.AWIDTH */
#define IFX_EBU_SDR_CON_AWIDTH_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.AWIDTH */
#define IFX_EBU_SDR_CON_AWIDTH_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.AWIDTH */
#define IFX_EBU_SDR_CON_AWIDTH_OFF (12)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.BANKM */
#define IFX_EBU_SDR_CON_BANKM_LEN (3)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.BANKM */
#define IFX_EBU_SDR_CON_BANKM_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.BANKM */
#define IFX_EBU_SDR_CON_BANKM_OFF (22)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CLKDIS */
#define IFX_EBU_SDR_CON_CLKDIS_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CLKDIS */
#define IFX_EBU_SDR_CON_CLKDIS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CLKDIS */
#define IFX_EBU_SDR_CON_CLKDIS_OFF (28)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CRAS */
#define IFX_EBU_SDR_CON_CRAS_LEN (4)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CRAS */
#define IFX_EBU_SDR_CON_CRAS_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CRAS */
#define IFX_EBU_SDR_CON_CRAS_OFF (0)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CRC */
#define IFX_EBU_SDR_CON_CRC_LEN (6)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CRC */
#define IFX_EBU_SDR_CON_CRC_MSK (0x3f)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CRC */
#define IFX_EBU_SDR_CON_CRC_OFF (16)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CRCD */
#define IFX_EBU_SDR_CON_CRCD_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CRCD */
#define IFX_EBU_SDR_CON_CRCD_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CRCD */
#define IFX_EBU_SDR_CON_CRCD_OFF (14)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CRFSH */
#define IFX_EBU_SDR_CON_CRFSH_LEN (4)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CRFSH */
#define IFX_EBU_SDR_CON_CRFSH_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CRFSH */
#define IFX_EBU_SDR_CON_CRFSH_OFF (4)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CRP */
#define IFX_EBU_SDR_CON_CRP_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CRP */
#define IFX_EBU_SDR_CON_CRP_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CRP */
#define IFX_EBU_SDR_CON_CRP_OFF (10)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.CRSC */
#define IFX_EBU_SDR_CON_CRSC_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.CRSC */
#define IFX_EBU_SDR_CON_CRSC_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.CRSC */
#define IFX_EBU_SDR_CON_CRSC_OFF (8)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.PWR_MODE */
#define IFX_EBU_SDR_CON_PWR_MODE_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.PWR_MODE */
#define IFX_EBU_SDR_CON_PWR_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.PWR_MODE */
#define IFX_EBU_SDR_CON_PWR_MODE_OFF (29)

/** \\brief  Length for Ifx_EBU_SDR_CON_Bits.SDCMSEL */
#define IFX_EBU_SDR_CON_SDCMSEL_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_CON_Bits.SDCMSEL */
#define IFX_EBU_SDR_CON_SDCMSEL_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_CON_Bits.SDCMSEL */
#define IFX_EBU_SDR_CON_SDCMSEL_OFF (31)

/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.BTYP */
#define IFX_EBU_SDR_MOD_BTYP_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.BTYP */
#define IFX_EBU_SDR_MOD_BTYP_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.BTYP */
#define IFX_EBU_SDR_MOD_BTYP_OFF (3)

/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.BURSTL */
#define IFX_EBU_SDR_MOD_BURSTL_LEN (3)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.BURSTL */
#define IFX_EBU_SDR_MOD_BURSTL_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.BURSTL */
#define IFX_EBU_SDR_MOD_BURSTL_OFF (0)

/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.CASLAT */
#define IFX_EBU_SDR_MOD_CASLAT_LEN (3)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.CASLAT */
#define IFX_EBU_SDR_MOD_CASLAT_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.CASLAT */
#define IFX_EBU_SDR_MOD_CASLAT_OFF (4)

/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.COLDSTART */
#define IFX_EBU_SDR_MOD_COLDSTART_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.COLDSTART */
#define IFX_EBU_SDR_MOD_COLDSTART_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.COLDSTART */
#define IFX_EBU_SDR_MOD_COLDSTART_OFF (15)

/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.OPMODE */
#define IFX_EBU_SDR_MOD_OPMODE_LEN (7)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.OPMODE */
#define IFX_EBU_SDR_MOD_OPMODE_MSK (0x7f)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.OPMODE */
#define IFX_EBU_SDR_MOD_OPMODE_OFF (7)

