HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_bf.h
/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.XBA */
#define IFX_EBU_SDR_MOD_XBA_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.XBA */
#define IFX_EBU_SDR_MOD_XBA_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.XBA */
#define IFX_EBU_SDR_MOD_XBA_OFF (30)

/** \\brief  Length for Ifx_EBU_SDR_MOD_Bits.XOPM */
#define IFX_EBU_SDR_MOD_XOPM_LEN (14)

/** \\brief  Mask for Ifx_EBU_SDR_MOD_Bits.XOPM */
#define IFX_EBU_SDR_MOD_XOPM_MSK (0x3fff)

/** \\brief  Offset for Ifx_EBU_SDR_MOD_Bits.XOPM */
#define IFX_EBU_SDR_MOD_XOPM_OFF (16)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.ARFSH */
#define IFX_EBU_SDR_REF_ARFSH_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.ARFSH */
#define IFX_EBU_SDR_REF_ARFSH_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.ARFSH */
#define IFX_EBU_SDR_REF_ARFSH_OFF (24)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.AUTOSELFR */
#define IFX_EBU_SDR_REF_AUTOSELFR_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.AUTOSELFR */
#define IFX_EBU_SDR_REF_AUTOSELFR_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.AUTOSELFR */
#define IFX_EBU_SDR_REF_AUTOSELFR_OFF (13)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.ERFSHC */
#define IFX_EBU_SDR_REF_ERFSHC_LEN (2)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.ERFSHC */
#define IFX_EBU_SDR_REF_ERFSHC_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.ERFSHC */
#define IFX_EBU_SDR_REF_ERFSHC_OFF (14)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.REFRESHC */
#define IFX_EBU_SDR_REF_REFRESHC_LEN (6)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.REFRESHC */
#define IFX_EBU_SDR_REF_REFRESHC_MSK (0x3f)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.REFRESHC */
#define IFX_EBU_SDR_REF_REFRESHC_OFF (0)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.REFRESHR */
#define IFX_EBU_SDR_REF_REFRESHR_LEN (3)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.REFRESHR */
#define IFX_EBU_SDR_REF_REFRESHR_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.REFRESHR */
#define IFX_EBU_SDR_REF_REFRESHR_OFF (6)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.RES_DLY */
#define IFX_EBU_SDR_REF_RES_DLY_LEN (3)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.RES_DLY */
#define IFX_EBU_SDR_REF_RES_DLY_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.RES_DLY */
#define IFX_EBU_SDR_REF_RES_DLY_OFF (25)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.SELFREN */
#define IFX_EBU_SDR_REF_SELFREN_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.SELFREN */
#define IFX_EBU_SDR_REF_SELFREN_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.SELFREN */
#define IFX_EBU_SDR_REF_SELFREN_OFF (12)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.SELFRENST */
#define IFX_EBU_SDR_REF_SELFRENST_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.SELFRENST */
#define IFX_EBU_SDR_REF_SELFRENST_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.SELFRENST */
#define IFX_EBU_SDR_REF_SELFRENST_OFF (11)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.SELFREX_DLY */
#define IFX_EBU_SDR_REF_SELFREX_DLY_LEN (8)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.SELFREX_DLY */
#define IFX_EBU_SDR_REF_SELFREX_DLY_MSK (0xff)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.SELFREX_DLY */
#define IFX_EBU_SDR_REF_SELFREX_DLY_OFF (16)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.SELFREX */
#define IFX_EBU_SDR_REF_SELFREX_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.SELFREX */
#define IFX_EBU_SDR_REF_SELFREX_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.SELFREX */
#define IFX_EBU_SDR_REF_SELFREX_OFF (10)

/** \\brief  Length for Ifx_EBU_SDR_REF_Bits.SELFREXST */
#define IFX_EBU_SDR_REF_SELFREXST_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_REF_Bits.SELFREXST */
#define IFX_EBU_SDR_REF_SELFREXST_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_REF_Bits.SELFREXST */
#define IFX_EBU_SDR_REF_SELFREXST_OFF (9)

/** \\brief  Length for Ifx_EBU_SDR_STAT_Bits.REFERR */
#define IFX_EBU_SDR_STAT_REFERR_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_STAT_Bits.REFERR */
#define IFX_EBU_SDR_STAT_REFERR_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_STAT_Bits.REFERR */
#define IFX_EBU_SDR_STAT_REFERR_OFF (0)

/** \\brief  Length for Ifx_EBU_SDR_STAT_Bits.SDERR */
#define IFX_EBU_SDR_STAT_SDERR_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_STAT_Bits.SDERR */
#define IFX_EBU_SDR_STAT_SDERR_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_STAT_Bits.SDERR */
#define IFX_EBU_SDR_STAT_SDERR_OFF (2)

/** \\brief  Length for Ifx_EBU_SDR_STAT_Bits.SDRMBUSY */
#define IFX_EBU_SDR_STAT_SDRMBUSY_LEN (1)

/** \\brief  Mask for Ifx_EBU_SDR_STAT_Bits.SDRMBUSY */
#define IFX_EBU_SDR_STAT_SDRMBUSY_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_STAT_Bits.SDRMBUSY */
#define IFX_EBU_SDR_STAT_SDRMBUSY_OFF (1)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_LEN (4)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_OFF (16)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_LEN (1)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_OFF (31)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_LEN (1)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_OFF (30)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_LEN (1)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_OFF (0)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_LEN (7)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_MSK (0x7f)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_OFF (1)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.RES1 */
#define IFX_EBU_USERCON_RES1_LEN (8)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.RES1 */
#define IFX_EBU_USERCON_RES1_MSK (0xff)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.RES1 */
#define IFX_EBU_USERCON_RES1_OFF (8)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.RES */
#define IFX_EBU_USERCON_RES_LEN (2)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.RES */
#define IFX_EBU_USERCON_RES_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.RES */
#define IFX_EBU_USERCON_RES_OFF (28)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEBU_BF_H */
